Ran Plan for 2 projects:

1. dir: `deploy/dev/eu-west-1/infrastructure/vpc` workspace: `default`
1. dir: `deploy/dev/eu-west-1/services/web-server` workspace: `default`

### 1. dir: `deploy/dev/eu-west-1/infrastructure/vpc` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Contact"     = "marcus.tse"
          + "Environment" = "Development"
          + "Name"        = "Terragrunt-VPC"
          + "Owner"       = "Marcus"
          + "Project"     = "Terragrunt Medium"
        }
      + tags_all             = {
          + "Contact"     = "marcus.tse"
          + "Environment" = "Development"
          + "Name"        = "Terragrunt-VPC"
          + "Owner"       = "Marcus"
          + "Project"     = "Terragrunt Medium"
        }
      + vpc                  = true
    }

  # aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Contact"     = "marcus.tse"
          + "Environment" = "Development"
          + "Name"        = "Terragrunt-VPC"
          + "Owner"       = "Marcus"
          + "Project"     = "Terragrunt Medium"
        }
      + tags_all = {
          + "Contact"     = "marcus.tse"
          + "Environment" = "Development"
          + "Name"        = "Terragrunt-VPC"
          + "Owner"       = "Marcus"
          + "Project"     = "Terragrunt Medium"
        }
      + vpc_id   = (known after apply)
    }

  # aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Contact"     = "marcus.tse"
          + "Environment" = "Development"
          + "Name"        = "Terragrunt-VPC"
          + "Owner"       = "Marcus"
          + "Project"     = "Terragrunt Medium"
        }
      + tags_all             = {
          + "Contact"     = "marcus.tse"
          + "Environment" = "Development"
          + "Name"        = "Terragrunt-VPC"
          + "Owner"       = "Marcus"
          + "Project"     = "Terragrunt Medium"
        }
    }

  # aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Contact"     = "marcus.tse"
          + "Environment" = "Development"
          + "Name"        = "Terragrunt-VPC"
          + "Owner"       = "Marcus"
          + "Project"     = "Terragrunt Medium"
        }
      + tags_all         = {
          + "Contact"     = "marcus.tse"
          + "Environment" = "Development"
          + "Name"        = "Terragrunt-VPC"
          + "Owner"       = "Marcus"
          + "Project"     = "Terragrunt Medium"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Contact"     = "marcus.tse"
          + "Environment" = "Development"
          + "Name"        = "Terragrunt-VPC"
          + "Owner"       = "Marcus"
          + "Project"     = "Terragrunt Medium"
        }
      + tags_all         = {
          + "Contact"     = "marcus.tse"
          + "Environment" = "Development"
          + "Name"        = "Terragrunt-VPC"
          + "Owner"       = "Marcus"
          + "Project"     = "Terragrunt Medium"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Contact"     = "marcus.tse"
          + "Environment" = "Development"
          + "Name"        = "Terragrunt-VPC"
          + "Owner"       = "Marcus"
          + "Project"     = "Terragrunt Medium"
        }
      + tags_all                                       = {
          + "Contact"     = "marcus.tse"
          + "Environment" = "Development"
          + "Name"        = "Terragrunt-VPC"
          + "Owner"       = "Marcus"
          + "Project"     = "Terragrunt Medium"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Contact"     = "marcus.tse"
          + "Environment" = "Development"
          + "Name"        = "Terragrunt-VPC"
          + "Owner"       = "Marcus"
          + "Project"     = "Terragrunt Medium"
        }
      + tags_all                                       = {
          + "Contact"     = "marcus.tse"
          + "Environment" = "Development"
          + "Name"        = "Terragrunt-VPC"
          + "Owner"       = "Marcus"
          + "Project"     = "Terragrunt Medium"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Contact"     = "marcus.tse"
          + "Environment" = "Development"
          + "Name"        = "Terragrunt-VPC"
          + "Owner"       = "Marcus"
          + "Project"     = "Terragrunt Medium"
        }
      + tags_all                                       = {
          + "Contact"     = "marcus.tse"
          + "Environment" = "Development"
          + "Name"        = "Terragrunt-VPC"
          + "Owner"       = "Marcus"
          + "Project"     = "Terragrunt Medium"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Contact"     = "marcus.tse"
          + "Environment" = "Development"
          + "Name"        = "Terragrunt-VPC"
          + "Owner"       = "Marcus"
          + "Project"     = "Terragrunt Medium"
        }
      + tags_all                                       = {
          + "Contact"     = "marcus.tse"
          + "Environment" = "Development"
          + "Name"        = "Terragrunt-VPC"
          + "Owner"       = "Marcus"
          + "Project"     = "Terragrunt Medium"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Contact"     = "marcus.tse"
          + "Environment" = "Development"
          + "Name"        = "Terragrunt-VPC"
          + "Owner"       = "Marcus"
          + "Project"     = "Terragrunt Medium"
        }
      + tags_all                                       = {
          + "Contact"     = "marcus.tse"
          + "Environment" = "Development"
          + "Name"        = "Terragrunt-VPC"
          + "Owner"       = "Marcus"
          + "Project"     = "Terragrunt Medium"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.103.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Contact"     = "marcus.tse"
          + "Environment" = "Development"
          + "Name"        = "Terragrunt-VPC"
          + "Owner"       = "Marcus"
          + "Project"     = "Terragrunt Medium"
        }
      + tags_all                                       = {
          + "Contact"     = "marcus.tse"
          + "Environment" = "Development"
          + "Name"        = "Terragrunt-VPC"
          + "Owner"       = "Marcus"
          + "Project"     = "Terragrunt Medium"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = false
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Contact"     = "marcus.tse"
          + "Environment" = "Development"
          + "Name"        = "Terragrunt-VPC"
          + "Owner"       = "Marcus"
          + "Project"     = "Terragrunt Medium"
        }
      + tags_all                             = {
          + "Contact"     = "marcus.tse"
          + "Environment" = "Development"
          + "Name"        = "Terragrunt-VPC"
          + "Owner"       = "Marcus"
          + "Project"     = "Terragrunt Medium"
        }
    }

Plan: 20 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + azs                                         = [
      + "eu-west-1a",
      + "eu-west-1b",
      + "eu-west-1c",
    ]
  + cgw_arns                                    = []
  + cgw_ids                                     = []
  + database_nat_gateway_route_ids              = []
  + database_route_table_association_ids        = []
  + database_route_table_ids                    = [
      + (known after apply),
    ]
  + database_subnet_arns                        = []
  + database_subnets                            = []
  + database_subnets_cidr_blocks                = []
  + database_subnets_ipv6_cidr_blocks           = []
  + default_network_acl_id                      = (known after apply)
  + default_route_table_id                      = (known after apply)
  + default_security_group_id                   = (known after apply)
  + elasticache_route_table_association_ids     = []
  + elasticache_route_table_ids                 = [
      + (known after apply),
    ]
  + elasticache_subnet_arns                     = []
  + elasticache_subnets                         = []
  + elasticache_subnets_cidr_blocks             = []
  + elasticache_subnets_ipv6_cidr_blocks        = []
  + igw_arn                                     = (known after apply)
  + igw_id                                      = (known after apply)
  + intra_route_table_association_ids           = []
  + intra_route_table_ids                       = []
  + intra_subnet_arns                           = []
  + intra_subnets                               = []
  + intra_subnets_cidr_blocks                   = []
  + intra_subnets_ipv6_cidr_blocks              = []
  + name                                        = "Main"
  + nat_ids                                     = [
      + (known after apply),
    ]
  + nat_public_ips                              = [
      + (known after apply),
    ]
  + natgw_ids                                   = [
      + (known after apply),
    ]
  + outpost_subnet_arns                         = []
  + outpost_subnets                             = []
  + outpost_subnets_cidr_blocks                 = []
  + outpost_subnets_ipv6_cidr_blocks            = []
  + private_ipv6_egress_route_ids               = []
  + private_nat_gateway_route_ids               = [
      + (known after apply),
    ]
  + private_route_table_association_ids         = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + private_route_table_ids                     = [
      + (known after apply),
    ]
  + private_subnet_arns                         = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + private_subnets                             = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + private_subnets_cidr_blocks                 = [
      + "10.0.1.0/24",
      + "10.0.2.0/24",
      + "10.0.3.0/24",
    ]
  + private_subnets_ipv6_cidr_blocks            = [
      + null,
      + null,
      + null,
    ]
  + public_internet_gateway_route_id            = (known after apply)
  + public_route_table_association_ids          = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_route_table_ids                      = [
      + (known after apply),
    ]
  + public_subnet_arns                          = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_subnets                              = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_subnets_cidr_blocks                  = [
      + "10.0.101.0/24",
      + "10.0.102.0/24",
      + "10.0.103.0/24",
    ]
  + public_subnets_ipv6_cidr_blocks             = [
      + null,
      + null,
      + null,
    ]
  + redshift_public_route_table_association_ids = []
  + redshift_route_table_association_ids        = []
  + redshift_route_table_ids                    = [
      + (known after apply),
    ]
  + redshift_subnet_arns                        = []
  + redshift_subnets                            = []
  + redshift_subnets_cidr_blocks                = []
  + redshift_subnets_ipv6_cidr_blocks           = []
  + this_customer_gateway                       = {}
  + vpc_arn                                     = (known after apply)
  + vpc_cidr_block                              = "10.0.0.0/16"
  + vpc_enable_dns_hostnames                    = true
  + vpc_enable_dns_support                      = true
  + vpc_flow_log_destination_type               = "cloud-watch-logs"
  + vpc_id                                      = (known after apply)
  + vpc_instance_tenancy                        = "default"
  + vpc_ipv6_association_id                     = (known after apply)
  + vpc_ipv6_cidr_block                         = (known after apply)
  + vpc_main_route_table_id                     = (known after apply)
  + vpc_owner_id                                = (known after apply)
  + vpc_secondary_cidr_blocks                   = []

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /Users/pranav/.atlantis/repos/pranavs1995/terragrunt-atlantis/1/default/deploy/dev/eu-west-1/infrastructure/vpc/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/Users/pranav/.atlantis/repos/pranavs1995/terragrunt-atlantis/1/default/deploy/dev/eu-west-1/infrastructure/vpc/default.tfplan"

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d deploy/dev/eu-west-1/infrastructure/vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](https://9e3d-2402-e280-3e39-4cc-65f5-cdca-e9d6-27a9.in.ngrok.io/lock?id=pranavs1995%252Fterragrunt-atlantis%252Fdeploy%252Fdev%252Feu-west-1%252Finfrastructure%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d deploy/dev/eu-west-1/infrastructure/vpc`
</details>
Plan: 20 to add, 0 to change, 0 to destroy.

---
### 2. dir: `deploy/dev/eu-west-1/services/web-server` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_group.dev will be created
  + resource "aws_autoscaling_group" "dev" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + force_delete              = true
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = "EC2"
      + id                        = (known after apply)
      + launch_configuration      = (known after apply)
      + max_size                  = 1
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = "tools-eu-1-web-server-asg"
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + tags                      = [
          + {
              + "key"                 = "Name"
              + "propagate_at_launch" = "true"
              + "value"               = "tools-eu-1-web-server-asg"
            },
        ]
      + target_group_arns         = (known after apply)
      + vpc_zone_identifier       = [
          + "subnet-10000000",
          + "subnet-20000001",
          + "subnet-30000002",
        ]
      + wait_for_capacity_timeout = "10m"
    }

  # aws_iam_instance_profile.instance_profile will be created
  + resource "aws_iam_instance_profile" "instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "tools-eu-1-web-server"
      + path        = "/"
      + role        = "tools-eu-1-web-server"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_role.iam_role will be created
  + resource "aws_iam_role" "iam_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "tools-eu-1-web-server"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_launch_configuration.dev will be created
  + resource "aws_launch_configuration" "dev" {
      + arn                         = (known after apply)
      + associate_public_ip_address = (known after apply)
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = true
      + iam_instance_profile        = (known after apply)
      + id                          = (known after apply)
      + image_id                    = "ami-029cfca952b331b52"
      + instance_type               = "t2.micro"
      + key_name                    = (known after apply)
      + name                        = (known after apply)
      + name_prefix                 = "tools-eu-1-web-server-web-config"
      + security_groups             = (known after apply)
      + user_data                   = "e6b979e7b83b8c54df62b62575ba21aa25af92bc"

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + encrypted             = true
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_lb_listener_rule.external_forwarder_rule will be created
  + resource "aws_lb_listener_rule" "external_forwarder_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:eu-west-1:000000000000:listener/abcxyz"
      + priority     = 1
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {

          + path_pattern {
              + values = [
                  + "/",
                ]
            }
        }
    }

  # aws_lb_target_group.web_server will be created
  + resource "aws_lb_target_group" "web_server" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "tools-eu-1-http"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "tools-eu-1-web-server-http-target-group"
        }
      + tags_all                           = {
          + "Name" = "tools-eu-1-web-server-http-target-group"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-00000000"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 20
          + matcher             = (known after apply)
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 10
          + unhealthy_threshold = 5
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

  # aws_security_group.security_group will be created
  + resource "aws_security_group" "security_group" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "tools-eu-1-web-server-instance-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "tools-eu-1-web-security-group"
        }
      + tags_all               = {
          + "Name" = "tools-eu-1-web-security-group"
        }
      + vpc_id                 = "vpc-00000000"
    }

  # aws_security_group_rule.egress_all will be created
  + resource "aws_security_group_rule" "egress_all" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress all"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # aws_security_group_rule.external_port will be created
  + resource "aws_security_group_rule" "external_port" {
      + description              = "Ingress port - 80"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-sample-sg"
      + to_port                  = 80
      + type                     = "ingress"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + asg_arn = (known after apply)
╷
│ Warning: Argument is deprecated
│ 
│   with aws_autoscaling_group.dev,
│   on main.tf line 77, in resource "aws_autoscaling_group" "dev":
│   77:   tags = [
│   78:     {
│   79:       "key"                 = "Name"
│   80:       "value"               = "${var.environment}-${var.service}-asg"
│   81:       "propagate_at_launch" = true
│   82:     },
│   83:   ]
│ 
│ Use tag instead
╵

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /Users/pranav/.atlantis/repos/pranavs1995/terragrunt-atlantis/1/default/deploy/dev/eu-west-1/services/web-server/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/Users/pranav/.atlantis/repos/pranavs1995/terragrunt-atlantis/1/default/deploy/dev/eu-west-1/services/web-server/default.tfplan"

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d deploy/dev/eu-west-1/services/web-server`
* :put_litter_in_its_place: To **delete** this plan click [here](https://9e3d-2402-e280-3e39-4cc-65f5-cdca-e9d6-27a9.in.ngrok.io/lock?id=pranavs1995%252Fterragrunt-atlantis%252Fdeploy%252Fdev%252Feu-west-1%252Fservices%252Fweb-server%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d deploy/dev/eu-west-1/services/web-server`
</details>
Plan: 9 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
